leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5645SPORTS_H
#define _MPC5645SPORTS_H


/* Pad: 0*/
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_0 {49, 0}
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_0 {26, 0}

/* Pad: 1*/
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_1 {48, 0}
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_1 {25, 0}

/* Pad: 2*/
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 3*/
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 4*/
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 5*/
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 6*/
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 7*/
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 8*/
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_8 {28, 0}

/* Pad: 9*/
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_9 {27, 0}

/* Pad: 10*/
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 11*/
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 12*/
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 13*/
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 14*/
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 15*/
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 16*/
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 17*/
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_17 {0, 0}
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 18*/
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1

/* Pad: 19*/
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC1

/* Pad: 20*/
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 21*/
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 22*/
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 23*/
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_23 {44, 0}
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 24*/
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_24 {43, 0}
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 25*/
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_25 {42, 0}
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 26*/
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_CAN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_26 {1, 0}
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 27*/
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER PORT_FUNC2

