leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 28*/
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_28 {34, 0}
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 29*/
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_29 {35, 0}
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 30*/
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 31*/
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 32*/
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 33*/
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 34*/
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 35*/
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 36*/
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 37*/
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 38*/
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 39*/
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 40*/
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 41*/
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 42*/
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 43*/
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_43 {15, 0}

/* Pad: 44*/
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 45*/
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 46*/
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_46 {32, 0}

/* Pad: 47*/
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_47 {40, 0}

/* Pad: 48*/
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_48 {47, 0}

/* Pad: 49*/
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_49 {17, 0}

/* Pad: 50*/
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_50 {16, 0}

/* Pad: 51*/
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_51 {24, 0}

/* Pad: 52*/
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_52 {31, 0}

/* Pad: 53*/
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 54*/
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 55*/
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_55 {17, 1}

/* Pad: 56*/
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_56 {18, 0}

