leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 57*/
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_57 {19, 0}

/* Pad: 58*/
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_58 {20, 0}

/* Pad: 59*/
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_59 {21, 0}

/* Pad: 60*/
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_60 {22, 0}

/* Pad: 61*/
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_61 {23, 0}

/* Pad: 62*/
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 63*/
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 64*/
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 65*/
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 66*/
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 67*/
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 68*/
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 69*/
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 70*/
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_70 {43, 1}
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 71*/
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_71 {44, 1}
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 72*/
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 73*/
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_73 {45, 0}
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 74*/
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_74 {38, 0}
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_74 {49, 1}

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_75 {39, 0}
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_75 {12, 1}

/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_76 {40, 1}
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_76 {13, 1}

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_77 {39, 1}
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_LIN PORT_FUNC3

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_LIN PORT_FUNC3

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC1

