leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_86 {29, 0}

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_87 {30, 0}

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 93*/
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 94*/
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 95*/
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 96*/
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 97*/
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_98 {15, 1}
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 100*/
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 101*/
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_103 {45, 1}
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_104 {11, 0}
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_104 {32, 1}

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_106 {33, 0}
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_106 {16, 1}

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_107 {38, 1}
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_107 {17, 2}

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_108 {30, 1}

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_109 {29, 1}
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_109 {31, 1}

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_110 {28, 1}
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_110 {24, 1}

/* Pad: 111*/
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_111 {27, 1}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_111 {23, 1}
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_111 {23, 1}

/* Pad: 112*/
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_112 {26, 1}
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_112 {22, 1}

/* Pad: 113*/
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_113 {25, 1}
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_113 {21, 1}

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_114 {46, 0}
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_114 {20, 1}

