leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_115 {41, 0}
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_115 {19, 1}
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_115 {19, 1}

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_116 {39, 2}
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_116 {18, 1}

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_118 {32, 2}
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_118 {9, 0}

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_119 {41, 1}
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_119 {3, 0}

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_120 {33, 1}
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_120 {10, 0}

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_121 {42, 1}
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_122 {38, 2}
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_122 {11, 1}

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_123 {4, 0}
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_123 {34, 1}

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_124 {5, 0}
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_124 {35, 1}

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_125 {6, 0}
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_125 {36, 0}

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_126 {7, 0}
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_126 {37, 0}

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_127 {8, 0}
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_127 {33, 2}

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_LIN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_128 {51, 0}
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_131 {49, 2}
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_131 {36, 1}

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_132 {37, 1}

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_133 {1, 1}

