leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_135 {0, 1}
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_135 {46, 1}

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_136 {47, 1}

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_137 {9, 1}

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_138 {10, 1}

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_139 {11, 2}
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_139 {42, 2}

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_140 {12, 2}
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_140 {43, 2}

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_141 {13, 2}
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_141 {44, 2}

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_142 {3, 2}
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_142 {45, 2}

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_143 {34, 2}
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_144 {35, 2}
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_145 {36, 2}
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 146*/
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_146 {37, 2}
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 147*/
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 148*/
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 149*/
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_ICU PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_149 {41, 2}
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 150*/
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_CAN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_150 {2, 0}
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_150 {52, 0}
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 151*/
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 152*/
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_152 {9, 2}
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_152 {46, 2}

/* Pad: 153*/
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_ICU PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_153 {47, 2}

