leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 154*/
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_154 {12, 0}
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_154 {40, 2}

/* Pad: 155*/
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_155 {13, 0}
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_155 {47, 3}

/* Pad: 156*/
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_OTHER PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_156 {3, 2}
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_156 {16, 2}

/* Pad: 157*/
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_LIN PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_157 {51, 1}
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_157 {2, 1}
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_157 {24, 2}

/* Pad: 158*/
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_158 {31, 2}

/* Pad: 159*/
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 160*/
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 161*/
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 162*/
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 163*/
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_163 {51, 2}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_163 {4, 0}

/* Pad: 164*/
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_164 {5, 0}

/* Pad: 165*/
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 166*/
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 167*/
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 168*/
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 169*/
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 170*/
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 171*/
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_171 {52, 1}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_171 {6, 1}

/* Pad: 172*/
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_LIN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_172 {7, 1}

/* Pad: 173*/
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_173 {25, 2}

/* Pad: 174*/
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_174 {26, 2}

/* Pad: 175*/
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_175 {27, 2}

/* Pad: 176*/
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_176 {28, 2}

/* Pad: 177*/
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_177 {29, 2}

/* Pad: 178*/
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_178 {30, 2}

