leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5645S_portdefs.h
/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_CAN PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_179 {2, 2}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_179 {8, 1}

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_181 {19, 2}

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_182 {21, 2}

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_ICU PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_183 {23, 2}

/* Pad: 184*/
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0

#endif  /* _MPC5645SPORTS_H*/ 
